CSI API ETABS v1

# cCaseStaticNonlinearStagedGetInitialCase Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetInitialCase(
    	string Name,
    	ref string InitialCase
    )

    Function GetInitialCase (
    	Name As String,
    	ByRef InitialCase As String
    ) As Integer

    Dim instance As cCaseStaticNonlinearStaged
    Dim Name As String
    Dim InitialCase As String
    Dim returnValue As Integer

    returnValue = instance.GetInitialCase(Name,
    	InitialCase)

    int GetInitialCase(
    	String^ Name,
    	String^% InitialCase
    )

    abstract GetInitialCase :
            Name : string *
            InitialCase : string byref -> int

#### Parameters

Name

    Type: SystemString

InitialCase

    Type: SystemString

#### Return Value

Type: Int32

See Also

#### Reference

cCaseStaticNonlinearStaged
Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com